##算术运算符
'''
注意: / 中不能用 0 作为除数. 否则会 抛出异常
'''
# 整数 / 整数 结果可能是小数. 而不会截断
print(5 / 3)
# % 不是 "百分数", 而是求余数
print(7 % 3)
# ** 是求乘方. 不光能算整数次方, 还能算小数次方
print(4**2)
print(4**0.5)
#地板除//(取整除法),会对计算的结果进行向下取整
print(7//2)

##关系运算符
'''
像 < <= > >= == != 这一系列的运算符称为 关系运算符, 它们是在比较操作数之间的关系
'''
a1 = 10
b1 = 20
print(a1 > b1)
print(a1 < b1)
a2 = 'hello'
b2 = 'solity'
print(a2 > b2)
print(a2 < b2)
#对于浮点数来说, 不要使用 == 判定相等
print(0.1 + 0.2 == 0.3)
print(0.1+0.2)
#正确的比较方式: 不再严格比较相等了, 而是判定差值小于允许的误差范围
a3 = 0.1 + 0.2
b3 = 0.3
print(-0.000001 < (a3 - b3) < 0.000001)

##逻辑运算符
a4 = 10
b4 = 20
c4 = 30
print(a4 < b4 and b4 < c4)
print(a4 < b4 and b4 > c4)
print(a4 > b4 or b4 > c4)
print(a4 < b4 or b4 > c4)
print(not a4 < b4)
print(not a4 > b4)

##赋值运算符
#链式赋值
a5 = b5 = 10
print(a5,b5)
#多元赋值
a6, b6 = 10, 20
print(a6,b6)
#交换两个变量的值
a7 = 10
b7 = 20
print(f'a7 = {a7},b7 = {b7}')
'''多元赋值,一步完成交换'''
a7, b7 = b7, a7
print(f'a7 = {a7},b7 = {b7}')